jmeter.log
2025-07-05 17:45:08,945 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-07-05 17:45:08,964 INFO o.a.j.JMeter: Loading user properties from: C:\apache-jmeter-5.6.3\bin\user.properties
2025-07-05 17:45:08,964 INFO o.a.j.JMeter: Loading system properties from: C:\apache-jmeter-5.6.3\bin\system.properties
2025-07-05 17:45:08,970 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2025-07-05 17:45:08,971 INFO o.a.j.JMeter: Version 5.6.3
2025-07-05 17:45:08,971 INFO o.a.j.JMeter: java.version=21.0.7
2025-07-05 17:45:08,971 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2025-07-05 17:45:08,971 INFO o.a.j.JMeter: os.name=Windows 11
2025-07-05 17:45:08,971 INFO o.a.j.JMeter: os.arch=amd64
2025-07-05 17:45:08,971 INFO o.a.j.JMeter: os.version=10.0
2025-07-05 17:45:08,971 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-07-05 17:45:08,971 INFO o.a.j.JMeter: java.awt.headless=true
2025-07-05 17:45:08,971 INFO o.a.j.JMeter: Max memory     =1073741824
2025-07-05 17:45:08,971 INFO o.a.j.JMeter: Available Processors =16
2025-07-05 17:45:08,980 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-07-05 17:45:08,981 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-07-05 17:45:08,981 INFO o.a.j.JMeter: JMeterHome=C:\apache-jmeter-5.6.3
2025-07-05 17:45:08,981 INFO o.a.j.JMeter: user.dir  =C:\Users\User\Documents\UTM\Internet Programming\MBIP-1
2025-07-05 17:45:08,981 INFO o.a.j.JMeter: PWD       =C:\Users\User\Documents\UTM\Internet Programming\MBIP-1
2025-07-05 17:45:08,983 INFO o.a.j.JMeter: IP: 172.24.16.1 Name: LAPTOP-JM998I0I FullName: LAPTOP-JM998I0I.mshome.net
2025-07-05 17:45:08,995 INFO o.a.j.s.FileServer: Default base='C:\Users\User\Documents\UTM\Internet Programming\MBIP-1'
2025-07-05 17:45:08,997 INFO o.a.j.s.FileServer: Set new base='C:\Users\User\Documents\UTM\Internet Programming\MBIP-1'
2025-07-05 17:45:09,159 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-07-05 17:45:09,193 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-07-05 17:45:09,195 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-07-05 17:45:09,199 INFO o.a.j.s.SaveService: Loading file: test.jmx
2025-07-05 17:45:09,253 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-07-05 17:45:09,253 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-07-05 17:45:09,253 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-07-05 17:45:09,253 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-07-05 17:45:09,253 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-07-05 17:45:09,253 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-07-05 17:45:09,271 INFO o.a.j.JMeter: Creating summariser <summary>
2025-07-05 17:45:09,290 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-07-05 17:45:09,290 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-07-05 17:45:09,290 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-07-05 17:45:09,295 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-07-05 17:45:09,295 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-07-05 17:45:09,350 INFO o.a.j.r.ClassFinder: Will scan jar C:\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-manager-1.11.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-07-05 17:45:09,455 INFO o.a.j.JMeter: Running test (1751708709455)
2025-07-05 17:45:09,468 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : MBIP Users Load Test
2025-07-05 17:45:09,468 INFO o.a.j.e.StandardJMeterEngine: Starting 2 threads for group MBIP Users Load Test.
2025-07-05 17:45:09,468 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-07-05 17:45:09,468 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=2 ramp-up=5 delayedStart=false
2025-07-05 17:45:09,473 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-07-05 17:45:09,473 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-07-05 17:45:09,474 INFO o.a.j.t.JMeterThread: Thread started: MBIP Users Load Test 1-1
2025-07-05 17:45:09,488 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = LAPTOP-JM998I0I
2025-07-05 17:45:09,493 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-07-05 17:45:09,494 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-07-05 17:45:09,494 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2025-07-05 17:45:09,494 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-07-05 17:45:09,494 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-07-05 17:45:09,688 INFO o.a.j.t.JMeterThread: Thread is done: MBIP Users Load Test 1-1
2025-07-05 17:45:09,688 INFO o.a.j.t.JMeterThread: Thread finished: MBIP Users Load Test 1-1
2025-07-05 17:45:11,970 INFO o.a.j.t.JMeterThread: Thread started: MBIP Users Load Test 1-2
2025-07-05 17:45:12,058 INFO o.a.j.t.JMeterThread: Thread is done: MBIP Users Load Test 1-2
2025-07-05 17:45:12,058 INFO o.a.j.t.JMeterThread: Thread finished: MBIP Users Load Test 1-2
2025-07-05 17:45:12,058 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2025-07-05 17:45:12,060 INFO o.a.j.r.Summariser: summary =     12 in 00:00:03 =    4.6/s Avg:    17 Min:     3 Max:    72 Err:     0 (0.00%)